ci4/app/Controllers/Artikel.php

  public function admin()
  {
    $title = 'Daftar Artikel';
    $model = new ArtikelModel();
    $artikel = $model->findAll();
---
SELECT *
FROM `artikel`